<template>
  <div>
    <div class="container">
      <div class="row md-4">
        <div class="col-md-4 col-12 mt-4">
          <div class="card">
            <div class="card-body">
              <div class="title mb-1">
                {{ $t("content.pagesearch.pagesearchpath1") }}
              </div>
              <div>
                <b-form-input list="my-list-id"></b-form-input>

                <datalist id="my-list-id">
                  <option v-for="size in sizes" :key="size"> {{ size }}</option>
                </datalist>
              </div>
              <div class="title mb-1">
                {{ $t("content.pagesearch.pagesearchpath2") }}
              </div>
              <div>
                <b-form-input list="my-list-id2"></b-form-input>

                <datalist id="my-list-id2">
                  <option v-for="tests in test" :key="tests">
                    {{ tests }}
                  </option>
                </datalist>
              </div>
              <div class="title mt-2">
                {{ $t("content.pagesearch.pagesearchpath3") }}
              </div>
            </div>
          </div>
        </div>
        <div class="col-md-8 col-12 mt-4">
          <div
            class="row mb-4"
            v-for="jobsearch in jobsearchs"
            :key="jobsearch.id"
          >
            <div class="col">
              <div class="card hover" @click="push(jobsearch)">
                <div class="card-body">
                  <div class="row">
                    <div class="col text-right">
                      <p>{{ jobsearch.time }}</p>
                    </div>
                  </div>
                  <div class="row">
                    <div class="col-9">
                      <p>
                        {{
                          $i18n.locale === "th"
                            ? jobsearch.company.nameTh
                            : jobsearch.company.nameEn
                        }}
                      </p>
                      <p>
                        {{
                          $i18n.locale === "th"
                            ? jobsearch.jobcompany.th
                            : jobsearch.jobcompany.en
                        }}
                      </p>
                      <div class="row">
                        <div class="col-9">
                          <div class="row">
                            <div class="col-md-7 col-12 mb-1">
                              <i class="fas fa-search mr-3"></i
                              >{{
                                $i18n.locale === "th"
                                  ? jobsearch.options.province.provinceTh
                                  : jobsearch.options.province.provinceEn
                              }}
                            </div>
                            <div class="col-md-5 col-12 mb-1">
                              <i class="far fa-money-bill-alt mr-2"></i>
                              {{ jobsearch.options.salary }}
                            </div>
                            <div class="col-md-7 col-12 mb-1 ">
                              <i class="fas fa-home mr-2 "></i>
                              {{
                                $i18n.locale === "th"
                                  ? jobsearch.options.atwork.atworkTh
                                  : jobsearch.options.atwork.atworkEn
                              }}
                            </div>
                            <div class="col-md-5  col-12 mb-1">
                              <i class="fas fa-desktop mr-2"></i>
                              {{
                                $i18n.locale === "th"
                                  ? jobsearch.options.interview.interviewTh
                                  : jobsearch.options.interview.interviewEn
                              }}
                            </div>
                          </div>
                        </div>
                      </div>
                    </div>
                    <div class="col-md-3 col-12 make-a-claim-img ">
                      <img
                        :src="jobsearch.url"
                        alt=""
                        class="d-block mx-auto"
                      />
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
  <!-- <div
            class="card"
            v-for="jobsearchs in jobsearch"
            :key="jobsearchs.id"
          > -->
</template>
<script>
import Vue from "vue";
export default Vue.extend({
  component: {},
  data() {
    return {
      jobsearchs: [
        {
          id: "1",
          url: "images/aia.jpg",
          company: {
            nameTh: "บริษัทประกันภัยAIA",
            nameEn: "AIA"
          },
          jobcompany: {
            th: "เปิดรับสมัครหลายอัตรา",
            en: "Open for many applications"
          },
          time: "11.สค.64",
          options: {
            province: {
              provinceTh: "กรุงเทพ ฯ",
              provinceEn: "Bankok"
            },
            salary: "10,000฿",
            atwork: {
              atworkTh: "บ้าน",
              atworkEn: "Home"
            },
            interview: {
              interviewTh: "ออนไลน์",
              interviewEn: "online"
            },
            admissionRate: "2",
            content: `<H5>อาชีพที่คุณใฝ่ฝัน เป็นจริงได้ที่เอไอเอ</h5>
                <div>
                <p>พบประสบการณ์การทำงานที่แตกต่าง ที่เปิดให้คุณได้เติบโตไปกับบริษัทประกันชีวิตที่มีความเป็นเลิศในทุกๆ ด้าน กับตำแหน่งงานที่หลากหลาย ไม่ว่าจะเป็นงานด้านบริหาร การวางแผนกลยุทธ์ และงานด้านบริการลูกค้า พร้อมประตูสู่โอกาสสำคัญที่จะได้ร่วมงานกับเอไอเอ ในระดับภูมิภาคเอเชียแปซิฟิก</p>
                <h5>สวัสดิการ</h5>
                <ul>
                  <li>โบนัสรายไตรมาส และ รายปี</li>
                  <li>เงิน Incentive</li>
                  <li>ประกันกลุ่มของ AIA (ค่ารักษาพยาบาลผู้ป่วยนอก และผู้ป่วยใน โดยพนักงานไม่ต้องสำรองจ่าย)</li>
                  <li>ประกันสังคม</li>
                  <li>ลาพักร้อนประจำปี</li>
                  <li>ท่องเที่ยวประจำปีทั้งในและต่างประเทศ</li>
                </ul>
                <h5>ติดต่อ</h5>
                <ul>
                <li>คุณปุ๊กกี้ (ตำแหน่งงาน Telesale)</li>
                <li>บริษัท เอไอเอ จำกัด</li>
                <li>181 อาคาร A.I.A.Tower 1 (เอไอเอสำนักงานใหญ่) ถนนสุรวงศ์</li>
                <li>แขวงสี่พระยา เขตบางรัก กรุงเทพมหานคร 10500</li>
                <li>ทรศัพท์ : 089-229-3682, 02-783-4402</li>
                </ul>
                <h5>วิธีการเดินทาง</h5>
                <h5>**การเดินทางไปสำนักงานใหญ่**</h5>
                <ul>
                <li>BTS:สถานีช่องนนทรี ออกประตู3 นั่งวินเข้ามาเอไอเอสำนักงานใหญ่ อาคารเอไอเอ ทาวเวอร์ 1</li>
                <li>MRT:ลงสถานีสามย่าน ออกประตูฝั่งวัดหัวลำโพง แล้วนั่งวินไปเอไอเอสำนักงานใหญ่ อาคารเอไอเอ ทาวเวอร์ 1</li>
                <li>รถเมล์:สาย 15,76,77,109,115,163,514,542 ลงแยกเดโชถนนสีลม เดินเข้าไปในซอยได้100เมตรตึกอยู่ซ้ายมือ</li>
                <li>สาย 1,16,35,36,75,93 ผ่านหน้าบริษัทAIA</li>
                </ul>
                <h5>การเดินทางโดยรถตู้</h5>
                <ul>
                <li>รถตู้สายรังสิต และสายท่าน้ำนนท์ จอดรถตรงร้านอาหารสมบูรณ์โภชนา</li>
                <li>รถตู้สายปากเกร็ดและสายงามวงศ์วาน จอดตรงโรงพยาบาลเลิศสิน</li>
                <li>รถตู้สายดาวคะนองจอดตรงMRTศาลาแดง</li>
                </ul>
                </div>`
          }
        },
        {
          id: "2",
          url: "images/sing.jpg",
          company: {
            nameTh: "บริษัทสิงห์ คอร์เปอเรชั่น จํากัด",
            nameEn: "SINGHA CORPORATION COMPANY LIMITED."
          },
          jobcompany: {
            th: "เปิดรับสมัครหลายอัตรา",
            en: "Open for many applications"
          },
          time: "10:30",
          options: {
            province: {
              provinceTh: "ปทุมธานี",
              provinceEn: "pathumtani"
            },
            salary: "20,000฿",
            atwork: {
              atworkTh: "บริษัท",
              atworkEn: "Company"
            },
            interview: {
              interviewTh: "ออนไลน์",
              interviewEn: "online"
            },
            rate: "2",
            content: `
            <h5>น้ำสิงห์</h5>
            <p>บริษัท สิงห์ คอร์เปอเรชั่น จำกัด เป็นบริษัทในเครือที่สำคัญของ บริษัท บุญรอดบริวเวอรี่ จำกัด ก่อตั้งขึ้นเมื่อปี 2544 เพื่อบริหารการดำเนินงานของบริษัทในเครือบุญรอดกว่า 150 บริษัท และรายงานต่อที่ประชุมคณะกรรมการของบริษัท บุญรอดบริวเวอรี่ จำกัด</p>
            <h5>เงินเดือน</h5>
            <p>ตามโครงสร้างของบริษัทฯและประสบการณ์ + เบี้ยขยัน + คอมมิชชั่น + ค่าล้างรถ</p>
            <h5>สวัสดิการ</h5>
            <ul>
              <li>ปรับเงินเดือนประจำปี</li>
              <li>โบนัสประจำปี</li>
              <li>เบี้ยขยัน</li>
              <li>ค่าน้ำมัน</li>
              <li>ค่าตำแหน่ง</li>
              <li>ประกันสังคม</li>
              <li>ชุดฟอร์มพนักงาน</li>
              <li>ประกันอุบัติเหตุกลุ่ม</li>
            </ul>
             <h5>คุณสมบัติผู้สมัคร</h5>
            <ul>
              <li>ระดับการศึกษา ม.3 ขึ้นไป อ่านออก เขียนได้</li>
              <li>มีประสบณ์การอย่างน้อย 1 - 3 ปีขึ้นไป</li>
              <li>มีใบขับขี่รถยนต์ และเส้นทางในบริเวณเขตกรุงเทพฯเป็นอย่างดีโดยเฉพาะในเขตที่คลังสินค้าที่ตนเองสังกัดรับผิดชอบ</li>
              <li>ปฏิบัติ 6 วันที่ทำการ/สัปดาห์</li>
              <li>สุขภาพร่างกายแข็งแรงสามารถยกถังน้ำได้ 18.9 ลิตรส่งลูกค้าได้</li>
              <li>โรงงานดอนเมือง(ซ.วิภาดีรังสิต 41)จำนวนเปิดรับ 1 อัตรา</li>
            </ul>`
          }
        },
        {
          id: "3",
          url: "images/Makro.jpg",
          company: {
            nameTh: "บริษัท สยามแม็คโคร จำกัด (มหาชน)",
            nameEn: "Siam Makro Public Company Limited"
          },
          jobcompany: {
            th: "เปิดรับสมัครหลายอัตรา",
            en: "Open for many applications"
          },
          time: "22.ธค.64",
          options: {
            province: {
              provinceTh: "อุบลธานี",
              provinceEn: "Ubontani"
            },
            salary: "30,000฿",
            atwork: {
              atworkTh: "บ้าน",
              atworkEn: "Home"
            },
            interview: {
              interviewTh: "ออนไลน์",
              interviewEn: "online"
            },
            rate: "6",
            content: `<p>ดำเนินธุรกิจศูนย์จำหน่ายสินค้าระบบสมาชิกภายใต้ชื่อ "แม็คโคร" จัดจำหน่ายสินค้าอุปโภค บริโภค แบบครบวงจร ให้กับลูกค้าในราคาขายส่ง ปัจจุบันมีจำนวนสมาชิกกว่า 3.0 ล้านราย และมีสาขามากกว่า 135 สาขา</p>

            <p>"แม็คโคร" เป็นบริษัทที่มั่นคง เปิดดำเนินการมาแล้วเป็นเวลากว่า 30 ปี และเป็นบริษัทจดทะเบียนในตลาดหลักทรัพย์แห่งประเทศไทย ต้องการบุคคลากรที่มีคุณภาพเข้าร่วมงานในตำแหน่งต่างๆ หากคุณเป็นคนหนึ่งที่มีความสามารถและต้องการพัฒนาตนเองเข้าสู่ความเป็นมืออาชีพอย่างแท้จริง โปรดดูตำแหน่งที่คุณสนใจและสมัครเข้ามาเพื่อร่วมงานกับเรา
            สินค้าและบริการ
            ร้านค้าปลีก/ร้านโชห่วย แม็คโครจำหน่ายสินค้า ในราคาถูก เพื่อร้านค้าปลีก โชห่วยนำไปขายต่อได้กำไร
            โรงแรม/ร้านอาหาร/จัดเลี้ยง แม็คโครศูนย์จำหน่ายสินค้า สำหรับผู้ประกอบการมืออาชีพ ทั้งโรงแรม ร้านอาหาร จัดเลี้ยง
            ธุรกิจบริการ/สำนักงาน แม็คโครช่วยลดต้นทุน ให้ธุรกิจบริการ และทุกสำนักงาน มีกำไรเพิ่ม
            สวัสดิการ
            สวัสดิการสำหรับพนักงาน (เฉพาะพนักงานประจำ)</p>
            <ul>
            <li>Bonus สิ้นปี. และ special Bonus เดือน เม.ย. (ตามผลประกอบการของบริษัทฯ )</li>
            <li>กองทุนสำรองเลี้ยงชีพ</li>
            <li>วันลาพักร้อน</li>
            <li>ค่ารักษาพยาบาลผู้ป่วยใน/ผู้ป่วยนอก</li>
            <li>ประกันชีวิต</li>
            <li>สวัสดิการสำหรับพนักงานกรณีซื้อที่อยู่อาศัยกัับทางธนาคารที่เป็นคู่สัญญา</li>
            <li>อื่นๆ</li>
            </ul>
            `
          }
        },
        {
          id: "4",
          url: "images/gold-foil-logo-mockup_160403-97.jpg",
          company: {
            nameTh: "บริษัทโลโก จำกัด",
            nameEn: "logo Company Limited"
          },
          jobcompany: "เปิดรับสมัครหลายอัตรา",
          time: "21.กย.64",
          options: {
            province: {
              provinceTh: "กรุงเทพฯ",
              provinceEn: "bankok"
            },
            salary: "15,000฿",
            atwork: {
              atworkTh: "บ้าน",
              atworkEn: "Home"
            },
            interview: {
              interviewTh: "ออนไลน์",
              interviewEn: "online"
            },
            rate: "3",
            content: `
              <p>ไทยแลนด์เยลโล่เพจเจส ผู้บุกเบิกธุรกิจการให้บริการค้นหาข้อมูล รายชื่อ และหมายเลขโทรศัพท์ขององค์กรธุรกิจ การค้นหาสินค้า และบริการต่าง ๆ เป็นรายแรกของประเทศไทยมากว่า 30 ปี ด้วยรูปแบบของสื่อโฆษณาออนไลน์ การค้นหาข้อมูลธุรกิจ เช่น สินค้าทุกประเภท หมายเลขโทรศัพท์ของธุรกิจทาง www.yellowpages.co.th ซึ่งเป็น Website ที่มีผู้เข้าใช้งานกว่า 2 ล้านคนต่อเดือน และเป็น Website ที่ได้รับรางวัล ที่มีผู้เข้าใช้งานสูงสุดในหมวดธุรกิจจาก สถาบันจัดอันดับความนิยมการเข้าชมเว็บไซต์ของคนไทย Truehits.net นอกจากการให้บริการค้นหาข้อมูลขององค์กรธุรกิจแล้ว บริษัทฯ ยังทำธุรกิจ E-Commerce และบริการ Outsourcing Call Center ที่ได้รับความไว้วางใจจากบริษัทชั้นนำในการดำเนินการด้าน Call Center บริการต่าง ๆ บนโทรศัพท์มือถือด้วย Application YellowPages บน Smartphone ทุกรุ่นเพื่อช่วยให้การค้นหาหมายเลขโทรศัพท์ สินค้าและบริการของผู้บริโภคสัมผัสได้ง่าย เพียงแค่ปลายนิ้ว บริษัทฯ ดำเนินธุรกิจอย่างมืออาชีพด้วยทีมผู้บริหาร และพนักงานที่มีความสามารถ เราตั้งเป้าหมายในการเป็นแหล่งข้อมูลที่สมบูรณ์ที่สุดสำหรับผู้ซื้อทั่วประเทศที่ต้องการค้นหาผู้ขาย ไม่ว่าจะเป็นสินค้า หรือบริการ เพื่อให้ผู้ซื้อมีทางเลือกที่ดีที่สุด เราเชื่อว่าการบริการที่ดีที่สุดเกิดจากการที่พนักงานมีความสุขในการทำงาน ท่านอาจเป็นคนหนึ่งที่มีความเหมาะสมที่จะเข้าร่วมงานกับองค์กรของเรา
              สวัสดิการ
              (พนักงานประจำ)</p>
              <ul>
              <li>วันหยุดพักร้อนประจำปี เริ่มต้น 12-18 วันต่อปี (ผ่านทดลองงานใช้สิทธิ์ได้ทันที)</li>
              <li>มีการจัดฝึกอบรมเพิ่มความรู้ให้กับพนักงานตามสายงาน</li>
              <li>ประกันชีวิต-ประกันอุบัติเหตุ และประกันสุขภาพ</li>
              <li>ประกันสังคม</li>
              <li>ยารักษาเบื้องต้น</li>
              <li>ตรวจร่างกายประจำปี</li>
              <li>เงินกองทุนสำรองเลี้ยงชีพ</li>
              <li>สหกรณ์ออมทรัพย์</li>
              <li>สวัสดิการ กู้ซื้อบ้าน กู้เอนกประสงค์ (อัตราดอกเบี้ยพิเศษ)</li>
              <li>สิทธิ์การใช้ Promotion มือถือในราคาพิเศษ</li>
              <li>ทุนการศึกษาบุตร</li>
              <li>เข็มกลัดทองที่ระลึกทำงานครบ 20 ปี</li>
              <li>เงินช่วยเหลือกรณีต่าง ๆ</li>
              <li>งานเลี้ยงสังสรรค์ปีใหม่ และงานเลี้ยงต่าง ๆ</li>
              ติดต่อ
              <p>ฝ่ายทรัพยากรบุคคล (สำนักงานใหญ่ ชั้น28)
              Thailand YellowPages
              สำนักงานใหญ่ : เลขที่ 1126/2 อาคารวานิช 2 ชั้น 28 ห้อง 2803, 2804
              ถนนเพชรบุรีตัดใหม่ แขวงมักกะสัน เขตราชเทวี กรุงเทพมหานคร 10400</p>
            `
          }
        },
        {
          id: "6",
          url: "images/yellowPages.png",
          company: {
            nameTh: "บริษัทเยลโล่ แพทเจ็ท",
            nameEn: "Yellow PAGES"
          },
          jobcompany: "เปิดรับสมัครหลายอัตรา",
          time: "1.มก.64",
          options: {
            province: {
              provinceTh: "กรุงเทพฯ",
              provinceEn: "bankok"
            },
            salary: "10000",
            atwork: {
              atworkTh: "บ้าน",
              atworkEn: "Home"
            },
            interview: {
              interviewTh: "ออนไลน์",
              interviewEn: "online"
            },
            rate: "1",
            content: `
              <p>ไทยแลนด์เยลโล่เพจเจส ผู้บุกเบิกธุรกิจการให้บริการค้นหาข้อมูล รายชื่อ และหมายเลขโทรศัพท์ขององค์กรธุรกิจ การค้นหาสินค้า และบริการต่าง ๆ เป็นรายแรกของประเทศไทยมากว่า 30 ปี ด้วยรูปแบบของสื่อโฆษณาออนไลน์ การค้นหาข้อมูลธุรกิจ เช่น สินค้าทุกประเภท หมายเลขโทรศัพท์ของธุรกิจทาง www.yellowpages.co.th ซึ่งเป็น Website ที่มีผู้เข้าใช้งานกว่า 2 ล้านคนต่อเดือน และเป็น Website ที่ได้รับรางวัล ที่มีผู้เข้าใช้งานสูงสุดในหมวดธุรกิจจาก สถาบันจัดอันดับความนิยมการเข้าชมเว็บไซต์ของคนไทย Truehits.net นอกจากการให้บริการค้นหาข้อมูลขององค์กรธุรกิจแล้ว บริษัทฯ ยังทำธุรกิจ E-Commerce และบริการ Outsourcing Call Center ที่ได้รับความไว้วางใจจากบริษัทชั้นนำในการดำเนินการด้าน Call Center บริการต่าง ๆ บนโทรศัพท์มือถือด้วย Application YellowPages บน Smartphone ทุกรุ่นเพื่อช่วยให้การค้นหาหมายเลขโทรศัพท์ สินค้าและบริการของผู้บริโภคสัมผัสได้ง่าย เพียงแค่ปลายนิ้ว บริษัทฯ ดำเนินธุรกิจอย่างมืออาชีพด้วยทีมผู้บริหาร และพนักงานที่มีความสามารถ เราตั้งเป้าหมายในการเป็นแหล่งข้อมูลที่สมบูรณ์ที่สุดสำหรับผู้ซื้อทั่วประเทศที่ต้องการค้นหาผู้ขาย ไม่ว่าจะเป็นสินค้า หรือบริการ เพื่อให้ผู้ซื้อมีทางเลือกที่ดีที่สุด เราเชื่อว่าการบริการที่ดีที่สุดเกิดจากการที่พนักงานมีความสุขในการทำงาน ท่านอาจเป็นคนหนึ่งที่มีความเหมาะสมที่จะเข้าร่วมงานกับองค์กรของเรา
              สวัสดิการ
              (พนักงานประจำ)</p>
              <ul>
              <li>วันหยุดพักร้อนประจำปี เริ่มต้น 12-18 วันต่อปี (ผ่านทดลองงานใช้สิทธิ์ได้ทันที)</li>
              <li>มีการจัดฝึกอบรมเพิ่มความรู้ให้กับพนักงานตามสายงาน</li>
              <li>ประกันชีวิต-ประกันอุบัติเหตุ และประกันสุขภาพ</li>
              <li>ประกันสังคม</li>
              <li>ยารักษาเบื้องต้น</li>
              <li>ตรวจร่างกายประจำปี</li>
              <li>เงินกองทุนสำรองเลี้ยงชีพ</li>
              <li>สหกรณ์ออมทรัพย์</li>
              <li>สวัสดิการ กู้ซื้อบ้าน กู้เอนกประสงค์ (อัตราดอกเบี้ยพิเศษ)</li>
              <li>สิทธิ์การใช้ Promotion มือถือในราคาพิเศษ</li>
              <li>ทุนการศึกษาบุตร</li>
              <li>เข็มกลัดทองที่ระลึกทำงานครบ 20 ปี</li>
              <li>เงินช่วยเหลือกรณีต่าง ๆ</li>
              <li>งานเลี้ยงสังสรรค์ปีใหม่ และงานเลี้ยงต่าง ๆ</li>
              ติดต่อ
              <p>ฝ่ายทรัพยากรบุคคล (สำนักงานใหญ่ ชั้น28)
              Thailand YellowPages
              สำนักงานใหญ่ : เลขที่ 1126/2 อาคารวานิช 2 ชั้น 28 ห้อง 2803, 2804
              ถนนเพชรบุรีตัดใหม่ แขวงมักกะสัน เขตราชเทวี กรุงเทพมหานคร 10400</p>
            `
          }
        }
      ],
      sizes: ["กำลังอยู่ในช่วงทดสอบ"],
      test: ["กำลังอยู่ในช่วงทดสอบ"]
    };
  },
  methods: {
    push(data) {
      this.$router.push({
        name: "_id",
        params: { id: data.id, company: data }
      });
    }
  }
});
</script>

<style lang="scss" scoped>
// .make-a-claim-img {
//   // position: relative;
// }
img {
  max-height: 120px;
  max-width: 120px;
  height: 100%;
  width: 100%;
  background-size: cover !important;
  top: 0;

  // position: absolute;
}
.hover {
  cursor: pointer;
  &:hover {
    box-shadow: 0 4px 8px 0 rgba(0, 0, 0, 0.2), 0 6px 20px 0 rgba(0, 0, 0, 0.19);
  }
}
</style>
